Repository: sanatillayev/Piyola
Catalog: Sources/Piyola/Resources/Strings/*.lproj/Order.strings
Languages: uz

source: Main
uz: Asosiy

source: Receipt
uz: Chek

source: Client
uz: Mijoz

source: Add
uz: Qo'shish

source: Not assigned yet
uz: Biriktirilmagan

# tariff
source: Delivery tariff
uz: Yetkazib berish tarifi

source: Car number
uz: Mashina raqami

source: Address name
uz: Manzil nomi

source: ASAP
uz: Tezroq

source: New Order
uz: Yangi Buyurtma

# estimatingFailed
source: Estimation Failed
uz: Baholash muvaffaqiyatsiz

source: Ready for Approval
uz: Tasdiqlashga tayyor

source: Failed
uz: Muvaffaqiyatsiz

# performerLookUp
source: Looking for Performer
uz: Kuryer qidirilmoqda

source: Performer Found
uz: Kuryer topildi

source: Performer Not Found
uz: Kuryer topilmadi

source: Accepted
uz: Qabul qilindi

# performerPickUpArrived
source: Pick-Up Arrived
uz: Olib ketish joyiga yetib keldi

# performerPickedUp
source: Picked Up
uz: Olib ketildi

# performerArrived
source: Arrived
uz: Manzilga yetib keldi

# performerDeliveredFinish
source: Delivered
uz: Yetkazib berildi

# performerReturning
source: Returning
uz: Qaytarilmoqda

# performerReturnArrived
source: Return Arrived
uz: Qaytish yetib keldi

# performerReturnedFinish
source: Returned
uz: Qaytarildi

source: Cancelled
uz: Bekor qilindi

source: Change Status
uz: Buyurtma holatini o'zgartirish

source: Delivery Type
uz: Yetkazib berish usuli

source: Press to Confirm
uz: Tasdiqlash uchun bosing

source: Show on Map
uz: Xaritada ko'rsatish

# emptyOrdersList
source: Orders list is empty
uz: Buyurtmalar ro'yxati bo'sh

source: Photo
uz: Rasm

# emptyCallHistory
source: Call history is empty
uz: Qo'ng'iroq tarixi bo'sh

# emptyPaymentHistory
source: Payment history is empty
uz: To'lov tarixi bo'sh
