Repository: sanatillayev/Piyola
Catalog: Sources/Piyola/Resources/Strings/*.lproj/Reason.strings
Languages: ru, uz

# orderDraftUpdate
source: Update order draft
ru: Обновить черновик заказа
uz: Buyurtma loyihasini yangilash

# orderDraftCreate
source: Create order draft
ru: Создать черновик заказа
uz: Buyurtma loyihasini yaratish

# orderDraftDelete
source: Delete order draft
ru: Удалить черновик заказа
uz: Buyurtma loyihasini o‘chirish

# orderCreate
source: Create order
ru: Создать заказ
uz: Buyurtma yaratish

# orderSendMessageTelegram
source: Send order message (Telegram)
ru: Отправить сообщение о заказе (Telegram)
uz: Buyurtma haqida xabar yuborish (Telegram)

# orderAtTimeCreate
source: Create order at specified time
ru: Создать заказ в назначенное время
uz: Buyurtmani belgilangan vaqtda yaratish

# orderSendPoster
source: Send order to poster
ru: Отправить заказ на постер
uz: Buyurtmani posterga yuborish

# orderProductsRefresh
source: Refresh order products
ru: Обновить товары заказа
uz: Buyurtma mahsulotlarini yangilash

# receiptSendClient
source: Send receipt to client
ru: Отправить чек клиенту
uz: Chiptani mijozga yuborish

# orderUpdatePaymentType
source: Update order payment type
ru: Обновить тип оплаты заказа
uz: Buyurtma to‘lov turini yangilash

# orderJoinToCourier
source: Assign order to courier
ru: Присоединить заказ к курьеру
uz: Buyurtmani kuryerga birlashtirish

# orderListJoinToCourier
source: Assign order list to courier
ru: Присоединить список заказов к курьеру
uz: Buyurtmalar ro‘yxatini kuryerga birlashtirish

source: Order paid by operator
ru: Заказ, оплаченный оператором
uz: Operator tomonidan to‘langan buyurtma

# orderUpdateAddressAndPaymentType
source: Update order address and payment type
ru: Обновить адрес и тип оплаты заказа
uz: Buyurtma manzili va to‘lov turini yangilash

# orderCommentUpdate
source: Update order comment
ru: Обновить комментарий к заказу
uz: Buyurtma izohini yangilash

# courierOrderCommentUpdate
source: Update courier order comment
ru: Обновить комментарий к заказу курьера
uz: Kuryer buyurtmasi izohini yangilash

source: Edit pick-up order status
ru: Редактировать статус pick-up заказа
uz: Pick-up buyurtmasi holatini tahrirlash

# allOrdersStatusChange
source: Change status of all orders
ru: Изменить статус всех заказов
uz: Barcha buyurtmalar holatini o‘zgartirish

# orderEditStatus
source: Edit order status
ru: Редактировать статус заказа
uz: Buyurtma holatini tahrirlash

# orderEditDeliveryType
source: Edit order delivery type
ru: Редактировать тип доставки заказа
uz: Buyurtma yetkazib berish turini tahrirlash

source: Update courier status
ru: Обновить статус курьера
uz: Kuryer holatini yangilash

# feedbackToCourier
source: Send feedback to courier
ru: Оставить отзыв курьеру
uz: Kuryerga fikr bildirish

# orderChangeServiceType
source: Change order service type
ru: Изменить тип услуги заказа
uz: Buyurtma xizmat turini o‘zgartirish

source: Change aggregator order
ru: Изменить заказ агрегатора
uz: Aggretator buyurtmasini o‘zgartirish

# orderSetCollectorImage
source: Add collector image to order
ru: Добавить изображение сборщика заказа
uz: Buyurtma yig‘uvchi rasmni qo‘shish

# orderSetOperator
source: Assign operator to order
ru: Назначить оператора для заказа
uz: Buyurtma operatorini belgilash

# orderCollectorCourierPaid
source: Order paid by collector courier
ru: Заказ, оплаченный сборщиком курьером
uz: Yig‘uvchi kuryer tomonidan to‘langan buyurtma

# smsGatewayCreate
source: Create SMS gateway
ru: Создать SMS шлюз
uz: SMS gateway yaratish

# smsGatewayUpdate
source: Update SMS gateway
ru: Обновить SMS шлюз
uz: SMS gateway yangilash

# smsGatewayTypeUpdate
source: Update SMS gateway type
ru: Обновить тип SMS шлюза
uz: SMS gateway turini yangilash

# smsGatewaySelectedUpdate
source: Update selected SMS gateway
ru: Обновить выбранный SMS шлюз
uz: Tanlangan SMS gatewayni yangilash

# smsGatewayDelete
source: Delete SMS gateway
ru: Удалить SMS шлюз
uz: SMS gateway o‘chirish

# newsCreate
source: Create news
ru: Создать новость
uz: Yangilik yaratish

# newsUpdate
source: Update news
ru: Обновить новость
uz: Yangilik yangilash

# newsDelete
source: Delete news
ru: Удалить новость
uz: Yangilik o‘chirish

source: Send target by price
ru: Отправить цель по цене
uz: Narx bo‘yicha maqsadni yuborish

# smsSendDriver
source: Send SMS to driver
ru: Отправить SMS водителю
uz: Haydovchiga SMS yuborish

# smsSettingsCreate
source: Create SMS settings
ru: Создать настройки SMS
uz: SMS sozlamalarini yaratish

# smsSend
source: Send SMS
ru: Отправить SMS
uz: SMS yuborish

# storyInfoCreate
source: Create story info
ru: Создать информацию о истории
uz: Hikoya ma'lumotlarini yaratish

# storyInfoUpdate
source: Update story info
ru: Обновить информацию о истории
uz: Hikoya ma'lumotlarini yangilash

# storyInfoUpdatePriority
source: Update story info with priority
ru: Обновить информацию о истории с приоритетом
uz: Hikoya ma'lumotlarini prioritet bilan yangilash

# storyInfoDelete
source: Delete story info
ru: Удалить информацию о истории
uz: Hikoya ma'lumotlarini o‘chirish

# storyCreate
source: Create story
ru: Создать историю
uz: Hikoya yaratish

# storyUpdate
source: Update story
ru: Обновить историю
uz: Hikoya yangilash

# storyUpdatePriority
source: Update story with priority
ru: Обновить историю с приоритетом
uz: Hikoya yangilishini prioritet bilan yangilash

# storyDelete
source: Delete story
ru: Удалить историю
uz: Hikoyani o‘chirish

# driverSettingsUpdate
source: Update driver settings
ru: Обновить настройки водителя
uz: Haydovchi sozlamalarini yangilash

# notificationUpdate
source: Update notification
ru: Обновить уведомление
uz: Bildirishnomani yangilash

# notificationDelete
source: Delete notification
ru: Удалить уведомление
uz: Bildirishnomani o‘chirish

source: Send payment settings update
ru: Отправить обновление настроек платежей
uz: To‘lov sozlamalarini yangilashni yuborish

# bookingCreate
source: Create booking
ru: Создать бронирование
uz: Buyurtma yaratish

# bookingUpdate
source: Update booking
ru: Обновить бронирование
uz: Buyurtmani yangilash

# bookingUpdateStatus
source: Update booking status
ru: Обновить статус бронирования
uz: Buyurtma holatini yangilash

# hallCreate
source: Create hall
ru: Создать зал
uz: Zal yaratish

# hallUpdate
source: Update hall
ru: Обновить зал
uz: Zalni yangilash

# hallDelete
source: Delete hall
ru: Удалить зал
uz: Zalni o‘chirish

# dineOrderCreate
source: Create dine order
ru: Создать заказ еды
uz: Ovqat buyurtmasini yaratish

# dineOrderUpdate
source: Update dine order
ru: Обновить заказ еды
uz: Ovqat buyurtmasini yangilash

# dineOrderUpdateStatus
source: Update dine order status
ru: Обновить статус заказа еды
uz: Ovqat buyurtmasi holatini yangilash

# tableUpdate
source: Update table
ru: Обновить стол
uz: Stolni yangilash

# tableCreate
source: Create table
ru: Создать стол
uz: Stol yaratish

# tableDelete
source: Delete table
ru: Удалить стол
uz: Stolni o‘chirish

# expressBranchUpdate
source: Update express branch
ru: Обновить экспресс филиал
uz: Express filialini yangilash

# expressProductRefresh
source: Refresh express products
ru: Обновить экспресс продукты
uz: Express mahsulotlarini yangilash

# eatsOrderDelete
source: Delete eats order
ru: Удалить заказ Eats
uz: Eats buyurtmasini o‘chirish

# eatsOrderCreate
source: Create eats order
ru: Создать заказ Eats
uz: Eats buyurtmasini yaratish

# eatsOrderUpdateStatus
source: Update eats order status
ru: Обновить статус заказа Eats
uz: Eats buyurtmasi holatini yangilash

# eatsSettingsUpdate
source: Update eats settings
ru: Обновить настройки Eats
uz: Eats sozlamalarini yangilash

# callUpdate
source: Update call
ru: Обновить звонок
uz: Qo‘ng‘iroqni yangilash

# callUpdateType
source: Update call type
ru: Обновить тип звонка
uz: Qo‘ng‘iroq turini yangilash

# callCreate
source: Create call
ru: Создать звонок
uz: Qo‘ng‘iroqni yaratish

# operatorPhoneCreate
source: Create operator phone number
ru: Создать телефонный номер оператора
uz: Operator telefon raqamini yaratish

# operatorPhoneDelete
source: Delete operator phone number
ru: Удалить телефонный номер оператора
uz: Operator telefon raqamini o‘chirish

# areaUpdate
source: Update area
ru: Обновить зону
uz: Hududni yangilash

# areaDelete
source: Delete area
ru: Удалить зону
uz: Hududni o‘chirish

source: Calculate delivery price by operator
ru: Рассчитать цену доставки оператором
uz: Operator orqali yetkazib berish narxini hisoblash

# courierTariffUpdate
source: Update courier tariff
ru: Обновить тариф курьера
uz: Kuryer tarifini yangilash

# courierTariffCreate
source: Create courier tariff
ru: Создать тариф курьера
uz: Kuryer tarifini yaratish

# deliveryPriceCalculateSettingUpdate
source: Update delivery price calculation settings
ru: Обновить настройки расчета цены доставки
uz: Yetkazib berish narxini hisoblash sozlamalarini yangilash

# deliverySettingsUpdate
source: Update delivery settings
ru: Обновить настройки доставки
uz: Yetkazib berish sozlamalarini yangilash

# deliveryTariffCreate
source: Create delivery tariff
ru: Создать тариф доставки
uz: Yetkazib berish tarifini yaratish

# deliveryTariffUpdate
source: Update delivery tariff
ru: Обновить тариф доставки
uz: Yetkazib berish tarifini yangilash

# deliveryTariffDelete
source: Delete delivery tariff
ru: Удалить тариф доставки
uz: Yetkazib berish tarifini o‘chirish

# driverUpdateStatus
source: Update driver status
ru: Обновить статус водителя
uz: Haydovchi holatini yangilash

# driverSetBranchAndTariff
source: Set branch and tariff for driver
ru: Назначить филиал и тариф водителю
uz: Haydovchiga filial va tarif belgilash

# driverSetVehicle
source: Set vehicle for driver
ru: Назначить транспортное средство водителю
uz: Haydovchiga transport vositasini belgilash

# findCourierSettingsUpdate
source: Update courier settings
ru: Обновить настройки курьера
uz: Kuryer sozlamalarini yangilash

# freeDeliveryUpdate
source: Update free delivery
ru: Обновить бесплатную доставку
uz: Bepul yetkazib berishni yangilash

# freeDeliveryCreate
source: Create free delivery
ru: Создать бесплатную доставку
uz: Bepul yetkazib berishni yaratish

# logistJoinBranch
source: Join logistics branch
ru: Присоединить к филиалу логистики
uz: Logistika filialiga qo‘shilish

# deliveryMapSettingsUpdate
source: Update delivery map settings
ru: Обновить настройки карты доставки
uz: Yetkazib berish xarita sozlamalarini yangilash

# merchantDeliveryKeysCreate
source: Create merchant delivery keys
ru: Создать ключи доставки для торговца
uz: Tadbirkor yetkazib berish kalitlarini yaratish

# merchantDeliveryKeysUpdate
source: Update merchant delivery keys
ru: Обновить ключи доставки для торговца
uz: Tadbirkor yetkazib berish kalitlarini yangilash

# merchantDeliveryKeysDelete
source: Delete merchant delivery keys
ru: Удалить ключи доставки для торговца
uz: Tadbirkor yetkazib berish kalitlarini o‘chirish

# merchantDeliveryKeysUpdateYandex
source: Update merchant Yandex delivery keys
ru: Обновить ключи доставки для торговца Yandex
uz: Tadbirkor Yandex yetkazib berish kalitlarini yangilash

# merchantDeliveryKeysUpdateActiveTypes
source: Update active merchant delivery key types
ru: Обновить активированные типы ключей доставки для торговца
uz: Tadbirkor faollashtirilgan yetkazib berish kalit turlarini yangilash

# millenniumSettingsUpdate
source: Update millennium settings
ru: Обновить настройки Millennium
uz: Millennium sozlamalarini yangilash

source: Order delivered by courier
ru: Заказ доставлен курьером
uz: Buyurtma kuryer tomonidan yetkazilgan

# ordersDeliveryOnWay
source: Orders on the way for delivery
ru: Заказы в пути
uz: Buyurtmalar yo‘lda yetkazilmoqda

# orderDeliveryReturned
source: Order returned
ru: Заказ возвращен
uz: Buyurtma qaytarilgan

# millenniumCheckPricePreOrder
source: Millennium pre-order price check
ru: Проверить цену предварительного заказа Millennium
uz: Millennium oldindan buyurtma narxini tekshirish

# millenniumOrderCreate
source: Create millennium order
ru: Создать заказ Millennium
uz: Millennium buyurtmasini yaratish

source: Millennium order canceled
ru: Заказ Millennium отменен
uz: Millennium buyurtmasi bekor qilingan

source: Create transaction by operator
ru: Создать транзакцию оператором
uz: Operator tomonidan tranzaktsiyani yaratish

# transportCreate
source: Create transport
ru: Создать транспорт
uz: Transportni yaratish

# transportUpdate
source: Update transport
ru: Обновить транспорт
uz: Transportni yangilash

# transportDelete
source: Delete transport
ru: Удалить транспорт
uz: Transportni o‘chirish

# yandexCheckPricePreOrder
source: Yandex pre-order price check
ru: Проверить цену предварительного заказа Yandex
uz: Yandex oldindan buyurtma narxini tekshirish

# yandexCreateOrderOperator
source: Create Yandex order by operator
ru: Создать заказ Yandex оператором
uz: Yandex operator tomonidan buyurtma yaratish

# yandexManuallyCreate
source: Manually create Yandex
ru: Создать заказ Yandex вручную
uz: Yandexni qo‘lda yaratish

# yandexConfirmByOrderId
source: Confirm Yandex by order ID
ru: Подтвердить Yandex по ID заказа
uz: Yandex buyurtma ID orqali tasdiqlash

# yandexConfirmByClaimId
source: Confirm Yandex by claim ID
ru: Подтвердить Yandex по ID претензии
uz: Yandex da'vo ID orqali tasdiqlash

# yandexCancelInfoByOrderId
source: Yandex cancellation info by order ID
ru: Информация об отмене Yandex по ID заказа
uz: Yandex buyurtma ID orqali bekor qilish ma'lumotlari

# yandexCancelInfoByClaimId
source: Yandex cancellation info by claim ID
ru: Информация об отмене Yandex по ID претензии
uz: Yandex da'vo ID orqali bekor qilish ma'lumotlari

# yandexCancelByOrderId
source: Cancel Yandex by order ID
ru: Отменить Yandex по ID заказа
uz: Yandex buyurtma ID orqali bekor qilish

# yandexCancelByClaimId
source: Cancel Yandex by claim ID
ru: Отменить Yandex по ID претензии
uz: Yandex da'vo ID orqali bekor qilish

source: Yandex confirmation code
ru: Код подтверждения Yandex
uz: Yandex tasdiqlash kodi

# manuallyOrderUpdate
source: Manually update order
ru: Обновить заказ вручную
uz: Qo‘lda buyurtma yangilash

# yandexSearchOrder
source: Search Yandex order
ru: Поиск заказа Yandex
uz: Yandex buyurtmasini qidirish

# telegramSendMessage
source: Send message via Telegram
ru: Отправить сообщение через Telegram
uz: Telegram orqali xabar yuborish

# telegramAssignUser
source: Assign user in Telegram
ru: Назначить пользователя в Telegram
uz: Telegram foydalanuvchisini tayinlash

# telegramCreateUser
source: Create user in Telegram
ru: Создать пользователя Telegram
uz: Telegram foydalanuvchisini yaratish

# telegramSearchUser
source: Search user in Telegram
ru: Поиск пользователя в Telegram
uz: Telegram foydalanuvchisini qidirish

# telegramSearchUserFromDb
source: Search user in Telegram from database
ru: Поиск пользователя Telegram в базе данных
uz: Telegram foydalanuvchisini ma'lumotlar bazasidan qidirish

# telegramGetChatHistory
source: Get Telegram chat history
ru: Получить историю чатов Telegram
uz: Telegram chat tarixini olish

# clientFeedbackSettingsUpdate
source: Update client feedback settings
ru: Обновить настройки отзывов клиентов
uz: Mijoz fikr-mulohazalari sozlamalarini yangilash
