Repository: sanatillayev/Piyola
Catalog: Sources/Piyola/Resources/Strings/*.lproj/Reason.strings
Languages: ru, uz

source: Update password
ru: Обновить пароль
uz: Parolni yangilash

source: Add staff
ru: Добавить сотрудника
uz: Xodim qo‘shish

source: Update staff
ru: Обновить сотрудника
uz: Xodimni yangilash

source: Update user
ru: Обновить пользователя
uz: Foydalanuvchini yangilash

source: Set Telegram chat ID
ru: Установить Telegram chat ID
uz: Telegram chat ID-ni o‘rnatish

source: Set Instagram chat ID
ru: Установить Instagram chat ID
uz: Instagram chat ID-ni o‘rnatish

source: Set Telegram username
ru: Установить Telegram username
uz: Telegram foydalanuvchi nomini o‘rnatish

# updatePhone
source: Update phone number
ru: Обновить номер телефона
uz: Telefon raqamini yangilash

source: Set poster ID
ru: Установить Poster ID
uz: Poster ID-ni o‘rnatish

source: Delete poster ID
ru: Удалить Poster ID
uz: Poster ID-ni o‘chirish

source: Update cashback
ru: Обновить Cashback
uz: Cashbackni yangilash

source: Create review
ru: Создать отзыв
uz: Sharh yaratish

source: Delete staff
ru: Удалить сотрудника
uz: Xodimni o‘chirish

# staffJoinBranch
source: Add staff to branch
ru: Добавить сотрудника в филиал
uz: Xodimni filialga qo‘shish

# staffSetWorkly
source: Set staff working hours
ru: Установить рабочее время сотрудника
uz: Xodim ish vaqtini belgilash

# staffDeleteBranch
source: Remove staff from branch
ru: Удалить сотрудника из филиала
uz: Xodimni filialdan o‘chirish

# staffDeleteWorkly
source: Remove staff working hours
ru: Удалить рабочее время сотрудника
uz: Xodim ish vaqtini o‘chirish

# staffUpdatePermissions
source: Update staff permissions
ru: Обновить права сотрудника
uz: Xodim ruxsatlarini yangilash

source: Update SMS content
ru: Обновить содержание SMS
uz: SMS mazmunini yangilash

source: Create merchant contact
ru: Создать контакт торговца
uz: Tadbirkor kontaktini yaratish

source: Update merchant contact
ru: Обновить контакт торговца
uz: Tadbirkor kontaktini yangilash

source: Delete merchant contact
ru: Удалить контакт торговца
uz: Tadbirkor kontaktini o‘chirish

source: Kell device sessions
ru: Сессии устройств Kell
uz: Kell qurilma sessiyalari

source: Update Firebase token
ru: Обновить Firebase token
uz: Firebase tokenini yangilash

source: Logout
ru: Выйти
uz: Chiqish

# cityCreate
source: Create city
ru: Создать город
uz: Shahar yaratish

# cityUpdate
source: Update city
ru: Обновить город
uz: Shaharni yangilash

# cityDelete
source: Delete city
ru: Удалить город
uz: Shaharni o‘chirish

# cityMerchantCreate
source: Create merchant in city
ru: Создать торговца в городе
uz: Shaharda tadbirkor yaratish

# cityMerchantDelete
source: Delete merchant from city
ru: Удалить торговца из города
uz: Shahardagi tadbirkorni o‘chirish

source: Update cashback settings
ru: Обновить настройки Cashback
uz: Cashback sozlamalarini yangilash

source: Create branch work hours
ru: Создать рабочие часы филиала
uz: Filial ish soatlarini yaratish

source: Update branch work hours
ru: Обновить рабочие часы филиала
uz: Filial ish soatlarini yangilash

source: Update branch settings
ru: Обновить настройки филиала
uz: Filial sozlamalarini yangilash

source: Create branch settings
ru: Создать настройки филиала
uz: Filial sozlamalarini yaratish

source: Create address
ru: Создать адрес
uz: Manzil yaratish

source: Update address
ru: Обновить адрес
uz: Manzilni yangilash

source: Delete address
ru: Удалить адрес
uz: Manzilni o‘chirish

source: Create admin
ru: Создать администратора
uz: Admin yaratish

source: Create badge
ru: Создать значок
uz: Nishon yaratish

source: Update badge
ru: Обновить значок
uz: Nishonni yangilash

source: Delete badge
ru: Удалить значок
uz: Nishonni o‘chirish

source: Create branch
ru: Создать филиал
uz: Filial yaratish

source: Update branch
ru: Обновить филиал
uz: Filialni yangilash

source: Delete branch
ru: Удалить филиал
uz: Filialni o‘chirish

# branchAssignCity
source: Assign branch to city
ru: Присвоить филиал городу
uz: Filialni shaharga biriktirish

# branchAssignCompany
source: Assign branch to company
ru: Присвоить филиал компании
uz: Filialni kompaniyaga biriktirish

# paymentAssignBranch
source: Assign payment to branch
ru: Присвоить филиал к оплате
uz: To‘lovni filialga biriktirish

# staffAssignPermission
source: Assign permission to staff
ru: Назначить права сотруднику
uz: Xodimga ruxsat berish

source: Create merchant
ru: Создать торговца
uz: Tadbirkor yaratish

source: Delete merchant
ru: Удалить торговца
uz: Tadbirkorni o‘chirish

source: Update merchant
ru: Обновить торговца
uz: Tadbirkorni yangilash

source: Update merchant poster
ru: Обновить постер торговца
uz: Tadbirkor posterini yangilash

# systemMenuAuthCreate
source: Create system menu authorization
ru: Создать авторизацию меню системы
uz: Tizim menyusi avtorizatsiyasini yaratish

# systemMenuAuthUpdate
source: Update system menu authorization
ru: Обновить авторизацию меню системы
uz: Tizim menyusi avtorizatsiyasini yangilash

# systemMenuAuthDelete
source: Delete system menu authorization
ru: Удалить авторизацию меню системы
uz: Tizim menyusi avtorizatsiyasini o‘chirish

# botCredentialsCreate
source: Create bot credentials
ru: Создать данные бота
uz: Bot maʼlumotlarini yaratish

# botCredentialsUpdate
source: Update bot credentials
ru: Обновить данные бота
uz: Bot maʼlumotlarini yangilash

# courierBotCredentialsUpdate
source: Update courier bot credentials
ru: Обновить данные бота для курьера
uz: Kuryer bot maʼlumotlarini yangilash

# botSettingsUpdate
source: Update bot settings
ru: Обновить настройки бота
uz: Bot sozlamalarini yangilash

# unitOrderStateUpdate
source: Update order state
ru: Обновить состояние заказа
uz: Buyurtma holatini yangilash

# unitOrderUpdate
source: Update order
ru: Обновить заказ
uz: Buyurtmani yangilash

# addressTargetCreate
source: Create target address
ru: Создать целевой адрес
uz: Maqsad manzilini yaratish

# addressTargetUpdate
source: Update target address
ru: Обновить целевой адрес
uz: Maqsad manzilini yangilash

# addressTargetDelete
source: Delete target address
ru: Удалить целевой адрес
uz: Maqsad manzilini o‘chirish

# analyticCreate
source: Create analytic
ru: Создать аналитику
uz: Analitikani yaratish

# bannerCreate
source: Create banner
ru: Создать баннер
uz: Banner yaratish

# bannerUpdate
source: Update banner
ru: Обновить баннер
uz: Bannerni yangilash

# bannerDelete
source: Delete banner
ru: Удалить баннер
uz: Bannerni o‘chirish

# branchAppSettingsUpdate
source: Update branch app settings
ru: Обновить настройки приложения филиала
uz: Filial ilovasi sozlamalarini yangilash

# collectorSettingsUpdate
source: Update collector settings
ru: Обновить настройки сборщика
uz: Yig‘uvchi sozlamalarini yangilash

# companyPoliciesUpdate
source: Update company policies
ru: Обновить политику компании
uz: Kompaniya siyosatlarini yangilash

# knowledgeCreate
source: Create knowledge
ru: Создать знание
uz: Bilim yaratish

# knowledgeUpdate
source: Update knowledge
ru: Обновить знание
uz: Bilimni yangilash

# knowledgeDelete
source: Delete knowledge
ru: Удалить знание
uz: Bilimni o‘chirish

# merchantMobileSettingsUpdate
source: Update merchant mobile settings
ru: Обновить мобильные настройки торговца
uz: Tadbirkor mobil sozlamalarini yangilash

# merchantQrSettingsUpdate
source: Update merchant QR settings
ru: Обновить QR настройки торговца
uz: Tadbirkor QR sozlamalarini yangilash

# merchantWebSettingsUpdate
source: Update merchant web settings
ru: Обновить веб-настройки торговца
uz: Tadbirkor veb sozlamalarini yangilash

# ticketUpdateStatus
source: Update ticket status
ru: Обновить статус билета
uz: Chiptaning holatini yangilash

# ticketDelete
source: Delete ticket
ru: Удалить билет
uz: Chiptani o‘chirish

# ticketUpdate
source: Update ticket
ru: Обновить билет
uz: Chiptani yangilash

# ticketCreate
source: Create ticket
ru: Создать билет
uz: Chiptani yaratish

# ticketThemeCreate
source: Create ticket theme
ru: Создать тему билета
uz: Chipta mavzusini yaratish

# ticketThemeUpdate
source: Update ticket theme
ru: Обновить тему билета
uz: Chipta mavzusini yangilash

# ticketThemeDelete
source: Delete ticket theme
ru: Удалить тему билета
uz: Chipta mavzusini o‘chirish

# todoCreate
source: Create task
ru: Создать задачу
uz: Vazifa yaratish

# todoUpdate
source: Update task
ru: Обновить задачу
uz: Vazifani yangilash

# todoDelete
source: Delete task
ru: Удалить задачу
uz: Vazifani o‘chirish

# todoUpdateStatus
source: Update task status
ru: Обновить статус задачи
uz: Vazifa holatini yangilash

# todoStatusCreate
source: Create task status
ru: Создать статус задачи
uz: Vazifa holatini yaratish

# todoStatusUpdate
source: Update task status
ru: Обновить статус задачи
uz: Vazifa holatini yangilash

# todoStatusDelete
source: Delete task status
ru: Удалить статус задачи
uz: Vazifa holatini o‘chirish

source: Update vendor settings
ru: Обновить настройки поставщика
uz: Yetkazib beruvchi sozlamalarini yangilash

# contractCreate
source: Create contract
ru: Создать контракт
uz: Shartnoma yaratish

# contractUpdate
source: Update contract
ru: Обновить контракт
uz: Shartnomani yangilash

# contractDelete
source: Delete contract
ru: Удалить контракт
uz: Shartnomani o‘chirish

# factoryCreate
source: Create factory
ru: Создать фабрику
uz: Fabrika yaratish

# factoryUpdate
source: Update factory
ru: Обновить фабрику
uz: Fabrikaning yangilanishi

# factoryDelete
source: Delete factory
ru: Удалить фабрику
uz: Fabrikani o‘chirish

# incomeCreate
source: Create income
ru: Создать доход
uz: Daromad yaratish

# incomeUpdate
source: Update income
ru: Обновить доход
uz: Daromadni yangilash

# outcomeCreate
source: Create outcome
ru: Создать расход
uz: Xarajat yaratish

# outcomeUpdate
source: Update outcome
ru: Обновить расход
uz: Xarajatni yangilash

# providerPaymentCreate
source: Create provider payment
ru: Создать платеж поставщика
uz: Ta’minotchining to‘lovini yaratish

# providerPaymentUpdate
source: Update provider payment
ru: Обновить платеж поставщика
uz: Ta’minotchining to‘lovini yangilash

# providerPaymentDelete
source: Delete provider payment
ru: Удалить платеж поставщика
uz: Ta’minotchining to‘lovini o‘chirish

# productUnitCreate
source: Create product unit
ru: Создать единицу товара
uz: Mahsulot birligini yaratish

# productUnitDelete
source: Delete product unit
ru: Удалить единицу товара
uz: Mahsulot birligini o‘chirish

# providerCreate
source: Create provider
ru: Создать поставщика
uz: Ta’minotchini yaratish

# providerUpdate
source: Update provider
ru: Обновить поставщика
uz: Ta’minotchini yangilash

# providerDelete
source: Delete provider
ru: Удалить поставщика
uz: Ta’minotchini o‘chirish

# providerTagCreate
source: Create provider tag
ru: Создать тег поставщика
uz: Ta’minotchi tegini yaratish

# providerTagDelete
source: Delete provider tag
ru: Удалить тег поставщика
uz: Ta’minotchi tegini o‘chirish

# tagCreate
source: Create tag
ru: Создать тег
uz: Teg yaratish

# tagUpdate
source: Update tag
ru: Обновить тег
uz: Tegni yangilash

# tagDelete
source: Delete tag
ru: Удалить тег
uz: Tegni o‘chirish

# branchTransactionCreate
source: Create branch transaction
ru: Создать транзакцию филиала
uz: Filial tranzaksiyasini yaratish

# branchTransactionUpdate
source: Update branch transaction
ru: Обновить транзакцию филиала
uz: Filial tranzaksiyasini yangilash

# branchTransactionDelete
source: Delete branch transaction
ru: Удалить транзакцию филиала
uz: Filial tranzaksiyasini o‘chirish

# unitCreate
source: Create unit
ru: Создать подразделение
uz: Birlik yaratish

# unitUpdate
source: Update unit
ru: Обновить подразделение
uz: Birlikni yangilash

# unitDelete
source: Delete unit
ru: Удалить подразделение
uz: Birlikni o‘chirish

# updateInventoryAmountMerchant
source: Update merchant inventory amount
ru: Обновить количество на складе торговца
uz: Tadbirkor inventar miqdorini yangilash

# updateInventoryAmountBranch
source: Update branch inventory amount
ru: Обновить количество на складе филиала
uz: Filial inventar miqdorini yangilash

source: Update inventory amount
ru: Обновить количество на складе
uz: Inventar miqdorini yangilash

# candidateDelete
source: Delete candidate
ru: Удалить кандидата
uz: Nomzodni o‘chirish

# candidateCreate
source: Create candidate
ru: Создать кандидата
uz: Nomzodni yaratish

# candidateUpdate
source: Update candidate
ru: Обновить кандидата
uz: Nomzodni yangilash

# staffCheckIn
source: Record staff check-in
ru: Зарегистрировать вход сотрудника
uz: Xodim kirishini qayd etish

# staffCheckOut
source: Record staff check-out
ru: Зарегистрировать выход сотрудника
uz: Xodim chiqishini qayd etish

# educationCreate
source: Create education
ru: Создать образование
uz: Ta’lim yaratish

# educationUpdate
source: Update education
ru: Обновить образование
uz: Ta’limni yangilash

# educationDelete
source: Delete education
ru: Удалить образование
uz: Ta’limni o‘chirish

# historyCreate
source: Create history
ru: Создать историю
uz: Tarix yaratish

# historyDelete
source: Delete history
ru: Удалить историю
uz: Tarixni o‘chirish

# categoryCreate
source: Create category
ru: Создать категорию
uz: Kategoriya yaratish

# categoryUpdate
source: Update category
ru: Обновить категорию
uz: Kategoriyani yangilash

# categoryDelete
source: Delete category
ru: Удалить категорию
uz: Kategoriyani o‘chirish

# extraDelete
source: Delete extra
ru: Удалить дополнение
uz: Qo‘shimchani o‘chirish

# extraUpdate
source: Update extra
ru: Обновить дополнение
uz: Qo‘shimchani yangilash

# extraCreate
source: Create extra
ru: Создать дополнение
uz: Qo‘shimcha yaratish

# groupDelete
source: Delete group
ru: Удалить группу
uz: Guruhi o‘chirish

# groupUpdate
source: Update group
ru: Обновить группу
uz: Guruhi yangilash

# groupCreate
source: Create group
ru: Создать группу
uz: Guruhi yaratish

# labelCreate
source: Create label
ru: Создать ярлык
uz: Yopishtiruvchi yaratish

# labelUpdate
source: Update label
ru: Обновить ярлык
uz: Yopishtiruvchini yangilash

# labelDelete
source: Delete label
ru: Удалить ярлык
uz: Yopishtiruvchini o‘chirish

# modificationBranchCreate
source: Create branch modification
ru: Создать изменение филиала
uz: Filialni o‘zgartirishni yaratish

# modificationBranchUpdate
source: Update branch modification
ru: Обновить изменение филиала
uz: Filialni o‘zgartirishni yangilash

# modificationBranchDelete
source: Delete branch modification
ru: Удалить изменение филиала
uz: Filialni o‘zgartirishni o‘chirish

# modificationCreate
source: Create modification
ru: Создать изменение
uz: O‘zgartirish yaratish

# modificationUpdate
source: Update modification
ru: Обновить изменение
uz: O‘zgartirishni yangilash

# modificationDelete
source: Delete modification
ru: Удалить изменение
uz: O‘zgartirishni o‘chirish

# modificationGroupBranchCreate
source: Create branch group modification
ru: Создать изменение группы филиала
uz: Filial guruhini o‘zgartirishni yaratish

# modificationGroupBranchUpdate
source: Update branch group modification
ru: Обновить изменение группы филиала
uz: Filial guruhini o‘zgartirishni yangilash

# modificationGroupBranchDelete
source: Delete branch group modification
ru: Удалить изменение группы филиала
uz: Filial guruhini o‘zgartirishni o‘chirish

# modificationGroupCreate
source: Create modification group
ru: Создать изменение группы
uz: O‘zgartirish guruhini yaratish

# modificationGroupUpdate
source: Update modification group
ru: Обновить изменение группы
uz: O‘zgartirish guruhini yangilash

# modificationGroupDelete
source: Delete modification group
ru: Удалить изменение группы
uz: O‘zgartirish guruhini o‘chirish

source: Import product from poster
ru: Импортировать товар с постера
uz: Posterdan mahsulot import qilish

source: Validate product from poster
ru: Подтвердить товар с постера
uz: Posterdan mahsulotni tasdiqlash

source: Create product from poster
ru: Создать товар с постера
uz: Posterdan mahsulot yaratish

# importProductFromPosterWithCategory
source: Import product with category from poster
ru: Импортировать товар с постера с категорией
uz: Kategoriya bilan posterdan mahsulot import qilish

source: Re-create product from poster
ru: Повторно создать товар с постера
uz: Posterdan mahsulotni qayta yaratish

# productBranchCreate
source: Create product branch
ru: Создать товарный филиал
uz: Mahsulot filialini yaratish

# productBranchDelete
source: Delete product branch
ru: Удалить товарный филиал
uz: Mahsulot filialini o‘chirish

# productCommentCreate
source: Create product comment
ru: Создать комментарий к товару
uz: Mahsulot izohini yaratish

# productCommentUpdate
source: Update product comment
ru: Обновить комментарий к товару
uz: Mahsulot izohini yangilash

# productCommentDelete
source: Delete product comment
ru: Удалить комментарий к товару
uz: Mahsulot izohini o‘chirish

# productCreate
source: Create product
ru: Создать товар
uz: Mahsulot yaratish

# productUpdate
source: Update product
ru: Обновить товар
uz: Mahsulotni yangilash

# productDelete
source: Delete product
ru: Удалить товар
uz: Mahsulotni o‘chirish

source: Update product type
ru: Обновить тип товара
uz: Mahsulot turini yangilash

source: Update product code
ru: Обновить код товара
uz: Mahsulot kodini yangilash

# productFavouriteCreate
source: Add product to favourites
ru: Добавить товар в избранное
uz: Mahsulotni sevimlilarga qo‘shish

# productFavouriteUpdate
source: Update product in favourites
ru: Обновить товар в избранном
uz: Mahsulotni sevimlilarda yangilash

# productFavouriteDelete
source: Remove product from favourites
ru: Удалить товар из избранного
uz: Mahsulotni sevimlilardan o‘chirish

# productLabelCreate
source: Create product label
ru: Создать тег товара
uz: Mahsulot tegini yaratish

# productLabelDelete
source: Delete product label
ru: Удалить тег товара
uz: Mahsulot tegini o‘chirish

# stopListCreate
source: Create stop list
ru: Создать список остановки
uz: To‘xtatilgan ro‘yxatni yaratish

source: Update product name from LaPoster
ru: Обновить название товара с LaPoster
uz: LaPoster’dan mahsulot nomini yangilash

# updateProductNameFromLaposterOne
source: Update first product name from LaPoster
ru: Обновить первое название товара с LaPoster
uz: LaPoster’dan birinchi mahsulot nomini yangilash

# bitoPaymentDelete
source: Delete Bito payment
ru: Удалить платеж Bito
uz: Bito to‘lovini o‘chirish

# bitoPaymentCreate
source: Create Bito payment
ru: Создать платеж Bito
uz: Bito to‘lovini yaratish

# bitoStateDelete
source: Delete Bito state
ru: Удалить состояние Bito
uz: Bito holatini o‘chirish

# bitoStateCreate
source: Create Bito state
ru: Создать состояние Bito
uz: Bito holatini yaratish

# iikoPaymentCreate
source: Create IIKO payment
ru: Создать платеж IIKO
uz: IIKO to‘lovini yaratish

# iikoPaymentDelete
source: Delete IIKO payment
ru: Удалить платеж IIKO
uz: IIKO to‘lovini o‘chirish

# restaurantCreate
source: Create restaurant
ru: Создать ресторан
uz: Restoran yaratish

# restaurantDelete
source: Delete restaurant
ru: Удалить ресторан
uz: Restoran o‘chirish

# merchantPosterUpdate
source: Update merchant poster
ru: Обновить постер торговца
uz: Tadbirkor posterini yangilash

# merchantPosterCommentUpdate
source: Update merchant poster comment
ru: Обновить комментарий к постеру торговца
uz: Tadbirkor posterining izohini yangilash

# merchantPosterCommentDelete
source: Delete merchant poster comment
ru: Удалить комментарий к постеру торговца
uz: Tadbirkor posterining izohini o‘chirish

source: Resend order to poster
ru: Переслать заказ на постер
uz: Buyurtmani posterni qayta yuborish

# posterStoplistUpdate
source: Update poster stop list
ru: Обновить список остановки постера
uz: Poster to‘xtatilgan ro‘yxatini yangilash

# posterPaymentTransaction
source: Create poster payment transaction
ru: Создать транзакцию платежа постера
uz: Poster to‘lov tranzaksiyasini yaratish

# paymentOutcomeCreate
source: Create payment outcome
ru: Создать исходящий платеж
uz: To‘lov chiqimlarini yaratish

# paymentTransactionCreate
source: Create payment transaction
ru: Создать транзакцию платежа
uz: To‘lov tranzaksiyasini yaratish

# paymentTransactionDriverCreate
source: Create driver payment transaction
ru: Создать транзакцию платежа водителя
uz: Haydovchi to‘lov tranzaksiyasini yaratish

# otherPaymentTypeUpdate
source: Update other payment type
ru: Обновить другой тип платежа
uz: Boshqa to‘lov turini yangilash

# otherPaymentTypeCreate
source: Create other payment type
ru: Создать другой тип платежа
uz: Boshqa to‘lov turini yaratish

# otherPaymentTypeDelete
source: Delete other payment type
ru: Удалить другой тип платежа
uz: Boshqa to‘lov turini o‘chirish

# paymentSettingsCreate
source: Create payment settings
ru: Создать настройки платежа
uz: To‘lov sozlamalarini yaratish

# paymentSettingsDelete
source: Delete payment settings
ru: Удалить настройки платежа
uz: To‘lov sozlamalarini o‘chirish

# companyUpdate
source: Update company
ru: Обновить компанию
uz: Kompaniyani yangilash

# expenseTypeCreate
source: Create expense type
ru: Создать тип расхода
uz: Xarajat turini yaratish

# expenseTypeUpdate
source: Update expense type
ru: Обновить тип расхода
uz: Xarajat turini yangilash

# expenseTypeDelete
source: Delete expense type
ru: Удалить тип расхода
uz: Xarajat turini o‘chirish

# eposCreate
source: Create EPOS
ru: Создать EPOS
uz: EPOS yaratish

# eposSettingsCreate
source: Create EPOS settings
ru: Создать настройки EPOS
uz: EPOS sozlamalarini yaratish

# eposSettingsUpdate
source: Update EPOS settings
ru: Обновить настройки EPOS
uz: EPOS sozlamalarini yangilash

# eposSettingsDelete
source: Delete EPOS settings
ru: Удалить настройки EPOS
uz: EPOS sozlamalarini o‘chirish

# availabilityCreate
source: Create availability
ru: Создать доступность
uz: Mavjudlikni yaratish

# availabilityDelete
source: Delete availability
ru: Удалить доступность
uz: Mavjudlikni o‘chirish

# updateAllPaymentMerchant
source: Update all payment merchants
ru: Обновить все платежи торговца
uz: Barcha to‘lov tadbirkorini yangilash

# paymentMerchantCreate
source: Create payment merchant
ru: Создать платежного торговца
uz: To‘lov tadbirkorini yaratish

# paymentMerchantUpdate
source: Update payment merchant
ru: Обновить платежного торговца
uz: To‘lov tadbirkorini yangilash

# paymentMerchantDelete
source: Delete payment merchant
ru: Удалить платежного торговца
uz: To‘lov tadbirkorini o‘chirish

# paymentMerchantActive
source: Activate payment merchant
ru: Активировать платежного торговца
uz: To‘lov tadbirkorini faol qilish

# paymentAccountCreate
source: Create payment account
ru: Создать платежный счет
uz: To‘lov hisobini yaratish

# paymentAccountUpdate
source: Update payment account
ru: Обновить платежный счет
uz: To‘lov hisobini yangilash

# paymentAccountDelete
source: Delete payment account
ru: Удалить платежный счет
uz: To‘lov hisobini o‘chirish

# promoCreate
source: Create promo
ru: Создать промо
uz: Promo yaratish

# promoUpdate
source: Update promo
ru: Обновить промо
uz: Promo yangilash

# promoDelete
source: Delete promo
ru: Удалить промо
uz: Promo o‘chirish

source: Generate new promo
ru: Создать новое промо
uz: Yangi promo yaratish

source: Add promo to user
ru: Добавить промо пользователю
uz: Promo’ni foydalanuvchiga qo‘shish

# orderFeedbackCreate
source: Create order feedback
ru: Создать отзыв о заказе
uz: Buyurtma fikrini yaratish

# orderFeedbackUpdate
source: Update order feedback
ru: Обновить отзыв о заказе
uz: Buyurtma fikrini yangilash

# orderFeedbackDelete
source: Delete order feedback
ru: Удалить отзыв о заказе
uz: Buyurtma fikrini o‘chirish

# orderMerchantSettingsCreate
source: Create order merchant settings
ru: Создать настройки торговца для заказа
uz: Buyurtma tadbirkori sozlamalarini yaratish

# orderMerchantSettingsUpdate
source: Update order merchant settings
ru: Обновить настройки торговца для заказа
uz: Buyurtma tadbirkori sozlamalarini yangilash
